import numpy as np
from sklearn.metrics import precision_score, recall_score, f1_score

# 🔹 모델이 예측한 값 (Predicted)
# 1 = 긍정 / 고장 / 이상
# 0 = 부정 / 정상
y_pred = np.array([0, 1, 1, 0, 1, 1, 1, 0])

# 🔹 실제 정답 값 (Ground Truth)
y_true = np.array([0, 1, 0, 0, 0, 0, 1, 1])


# =========================================
# 🔹 1. 정밀도 (Precision)
# =========================================
# "모델이 1이라고 예측한 것 중 실제로 1인 비율"
# → 거짓 양성(False Positive)을 얼마나 줄였는가

precision = precision_score(y_true, y_pred)

print("1. 정밀도(Precision)")
print(f"결과 : {precision}")
print()

# =========================================
# 1. 정밀도(Precision)
# 결과 : 0.4
# 이때 값은 2/5 라서 0.4가 나옴
# =========================================

# =========================================
# 🔹 2. 재현율 (Recall)
# =========================================
# "실제 1인 것 중 모델이 맞춘 비율"
# → 놓친 것(False Negative)을 얼마나 줄였는가

recall = recall_score(y_true, y_pred)

print("2. 재현율(Recall)")
print(f"결과 : {recall}")
print()

# =========================================
# 2. 재현율(Recall)
# 결과 : 0.6666666666666666
# 이떄 실제 1인 값이 3개가 있는데 이중 2개가 맞아서 0.666
# =========================================

# =========================================
# 🔹 3. F1 Score
# =========================================
# Precision과 Recall의 균형 (조화 평균)
# → 둘 다 중요할 때 사용하는 지표

f1 = f1_score(y_true, y_pred)

print("3. F1 스코어")
print(f"결과 : {f1}")
print()

# =========================================
# 3. F1 스코어
# 결과 : 0.5
# =========================================
